# Import NumPy and Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('PokemonData.csv')

df.head()

,Name,Type,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,url,icon
0,Bulbasaur,"['Grass', 'Poison']",318,45,49,49,65,65,45,https://pokemondb.net/pokedex/bulbasaur,https://img.pokemondb.net/sprites/sword-shield...
1,Ivysaur,"['Grass', 'Poison']",405,60,62,63,80,80,60,https://pokemondb.net/pokedex/ivysaur,https://img.pokemondb.net/sprites/sword-shield...
2,Venusaur,"['Grass', 'Poison']",525,80,82,83,100,100,80,https://pokemondb.net/pokedex/venusaur,https://img.pokemondb.net/sprites/sword-shield...
3,Charmander,"['Fire', '']",309,39,52,43,60,50,65,https://pokemondb.net/pokedex/charmander,https://img.pokemondb.net/sprites/sword-shield...
4,Charmeleon,"['Fire', '']",405,58,64,58,80,65,80,https://pokemondb.net/pokedex/charmeleon,https://img.pokemondb.net/sprites/sword-shield...

In [3]:
df.head()

,Name,Type,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,url,icon
0,Bulbasaur,"['Grass', 'Poison']",318,45,49,49,65,65,45,https://pokemondb.net/pokedex/bulbasaur,https://img.pokemondb.net/sprites/sword-shield...
1,Ivysaur,"['Grass', 'Poison']",405,60,62,63,80,80,60,https://pokemondb.net/pokedex/ivysaur,https://img.pokemondb.net/sprites/sword-shield...
2,Venusaur,"['Grass', 'Poison']",525,80,82,83,100,100,80,https://pokemondb.net/pokedex/venusaur,https://img.pokemondb.net/sprites/sword-shield...
3,Charmander,"['Fire', '']",309,39,52,43,60,50,65,https://pokemondb.net/pokedex/charmander,https://img.pokemondb.net/sprites/sword-shield...
4,Charmeleon,"['Fire', '']",405,58,64,58,80,65,80,https://pokemondb.net/pokedex/charmeleon,https://img.pokemondb.net/sprites/sword-shield...

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
pizza_toppings = ["Pepperoni", "Sausage", "Mushroom", "Onion"]
p = pd.Series(pizza_toppings)
p.values

array(['Pepperoni', 'Sausage', 'Mushroom', 'Onion'], dtype=object)

---

# Additional Information

## <a href="https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html">Docs: Remove Unwanted Columns</a>

_Functions used: np.arange, np.reshape, **df.drop**_

In [5]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),columns=['A', 'B', 'C', 'D']) 
        # pd.Dataframe creates a dataframe from the command inside the parenthesis
        # np.arange(12) creates an array that consists of 12 values
        # reshape(3,4) reshapes the array into 3 rows and 4 columns
        # columns=['A', 'B', 'C', 'D'] creates columns in the dataframe labeled as A,B,C,D 
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [6]:
# The columns B and C would be dropped/removed. 

#df.drop(['B', 'C'], axis=1)

df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [7]:
df.drop([0, 1])
    # This would drop the indexes 0 and 1.

   A  B   C   D
2  8  9  10  11

<div class="alert alert-block alert-info"><b>
There are also MultiIndex Dataframes but I am not using it yet.
</b></div>

---

## <a href="https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html">Docs: Separate Type column into</a>

# Move columns into specified position

https://www.geeksforgeeks.org/how-to-move-a-column-to-first-position-in-pandas-dataframe/

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.insert.html

In [8]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0], 
                  'response_eeme': [0.3, 0.22, 0.27, 0.08, 1.0]},
                  index=index)
df

           http_status  response_time  response_eeme
Firefox            200           0.04           0.30
Chrome             200           0.02           0.22
Safari             404           0.07           0.27
IE10               404           0.08           0.08
Konqueror          301           1.00           1.00

In [9]:
df = df.reindex(columns=['http_status', 'response_eeme'])

df

           http_status  response_eeme
Firefox            200           0.30
Chrome             200           0.22
Safari             404           0.27
IE10               404           0.08
Konqueror          301           1.00

In [10]:
import pandas as pd
  
  
# define data
data = {'Age': [55, 20, 35, 10], 'Name': ['Rohan', 'Ritik', 'Sangeeta', 'Yogesh'], 
        'Address': ['Lucknow', 'Delhi', 'Haridwar', 'Nainital'], 
        'Phone Number': [123456789, 234567890, 3456789012, 4567890123]}
  
# create dataframe
df = pd.DataFrame(data)
  
# print original dataframe
print("Original Dataframe")
display(df)

Original Dataframe

   Age      Name   Address  Phone Number
0   55     Rohan   Lucknow     123456789
1   20     Ritik     Delhi     234567890
2   35  Sangeeta  Haridwar    3456789012
3   10    Yogesh  Nainital    4567890123

In [11]:
# shift column 'Name' to first position
first_column = df.pop('Name')
    # df.pop('Name') stores the name column as a data assigned to as first_column
    

# insert column using insert(position,column_name,
# first_column) function
df.insert(0, 'Name', first_column)
    # Insert Name in the 0th column
    
print()
print("After Shifting column to first position")
display(df)

After Shifting column to first position

       Name  Age   Address  Phone Number
0     Rohan   55   Lucknow     123456789
1     Ritik   20     Delhi     234567890
2  Sangeeta   35  Haridwar    3456789012
3    Yogesh   10  Nainital    4567890123

In [12]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
                  
df

df.drop([1, 2], axis=0)

   A  B  C  D
0  0  1  2  3

In [13]:
index = pd.Index([3, 1, 2, 3, 4, np.nan])
index.value_counts()

3.0    2
1.0    1
2.0    1
4.0    1
dtype: int64